In [2]:
import pandas as pd

### Connect Pandas to the database with this URL:

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [15]:
y = titles
(y['year']//10 * 10).value_counts().sort_index()


#decade = [y['year']//10*10 for i in y['year']]
#y['decade'] = y['year']//10 * 10
#y
#y['decade'] = decade
#len(decade)
#y.groupby('decade').count()#.sort_values(by='year'))

1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: year, dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [16]:
h = titles
h = h[h.title == 'Hamlet'] 
h['decade'] = h['year']//10 * 10
h
h.groupby('decade')['decade'].value_counts()#.sort_values()

/home/ganesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

decade  decade
1910    1910      3
1920    1920      1
1940    1940      1
1950    1950      1
1960    1960      2
1970    1970      2
1980    1980      1
1990    1990      2
2000    2000      2
2010    2010      3
Name: decade, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [25]:
h = cast
h = h[h.year // 10 == 195]
h = h[h.type == "actor"]
h = h[h.n == 1.0]
h.groupby('year')['year'].value_counts()#.sort_values()

year  year
1950  1950    626
1951  1951    647
1952  1952    607
1953  1953    652
1954  1954    634
1955  1955    641
1956  1956    643
1957  1957    735
1958  1958    710
1959  1959    721
Name: year, dtype: int64

In [26]:
h = cast
h = h[h.year // 10 == 195]
h = h[h.type == "actress"]
h = h[h.n == 1.0] 
h.groupby('year')['year'].value_counts()#.sort_values()

year  year
1950  1950    281
1951  1951    281
1952  1952    293
1953  1953    301
1954  1954    310
1955  1955    281
1956  1956    305
1957  1957    301
1958  1958    295
1959  1959    317
Name: year, dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [21]:
h = cast
h = h[h.year // 10 == 195]
#h = h[h.type == "actress"]
#h = h[h.n == 1.0] # 1.0 =< n =<5.0
h = h[(h.n >= 1.0) & (h.n <=5.0)]
h.groupby(['year','n','type']).size()#.sort_values()

year  n    type
1950  1.0  actor      626
           actress    281
      2.0  actor      437
           actress    415
      3.0  actor      506
                     ...
1959  3.0  actress    372
      4.0  actor      594
           actress    311
      5.0  actor      579
           actress    269
Length: 100, dtype: int64

Series([], Name: year, dtype: int64)

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

### List each of the characters that Frank Oz has portrayed at least twice.